ERR_MES = [
    "まーまー、気軽にいこうよー\n道のりは長いよー？",
    "パークの危機ねー\nアライさんに付き合うよー",
    "はいよー",
    "うーん？",
    "あー、びーっくりしたー",
    "おー、ほんとにこっちだったー\nすごいよアライさーん",
    "おねーさんありがとー",
    "アライさーん、気を付けてよー",
    "こんなのを被った子を追いかけててー",
    "どーもどーもありがとー",
    "アライさーん、いそいじゃだめだってばー",
    "アラーイさーん",
    "だからゆっくりいこうってー",
    "いーねー",
    "わたしの大きい耳も、熱を逃がすのさー",
    "おー\nやっぱりー",
    "ほんとにいいお家だねー",
    "フレンズやわたし達にとって、とても大事なものが埋設されていることがわかりました\nその場所はー…",
    "はーい、よっと！",
    "たぶん、勘違いなんだけどねー",
    "というわけで、詳しい場所はわからないけど、山に入りたくってー",
    "えー",
    "へー、かばんさんも通ったのかー\nなにかと縁があるなー",
    "というわけでー、博士に許可もらったからその泥棒を追いつつ、お宝に向かってるのさー",
    "アライさん、ちょうど噴火した山にびっくりして、崖から落ちたんだってー",
    "ははー",
    "アライさん、またやってしまったねー",
    "この子がかばんさんだよー\nやけに帽子の子と同じ場所で話が出ると思ったよー",
    "でもー、かばんさんってそんなことする子かな？",
    "アライさんもべた褒めで、恩人だって言ってたじゃないかー\nきっと何か事情があるんだよ",
    "太陽が昇るほうが東、沈むのが西だからー\nこの印が北なんじゃないかな",
    "アライさんがいつも突っ走るからさー、星や太陽の位置を憶えるのは基本だよー",
    "こっちにもー",
    "掘り出すよー",
    "これをどうするのー？",
    "火ってなーに？",
    "おー",
    "わかったー",
    "なーに言ってるのさー\nパークの危機はみんなで解決しないとー",
    "あさっての方向に全力疾走ができるよー",
    "お〜〜",
    "かばんさーん",
    "だよー",
    "とりあえず、船にはできるって聞いたよー",

    "おっと、通り過ぎちゃうところだったよー 何かな？",
    "寒いのも暑いのも、割となんとかなるもんだよー",
    "アライさん、今度はどこにいくんだろーなー",
    "頼みごとぉー？いいよー、なんでもいってねー",
    "たくさん寝てすっきりー でももう少しねられそうかも…",
    "みんなが楽しく過ごすのが何よりだよねー うんうんほんとにそう思うなー",
    "やー、アライさんは元気でいーねー、私まで元気になってくるよー",
    "さてと…やりますかー…",
    "片付けますかー",
    "はいはーい",
    "わかったよー",
    "きたきたー",
    "任されたよー",
    "全力でやっちゃうよー？",
    "覚悟してねー？",
    "あらっ？",
    "こうさんこうさーん、私の負けだよー",
    "いい天気だねー、休憩しよっかー",
    "いい天気だねー",
    "さーてと、一息いれますかー",
    "やーらーれーたー",
    "ちょっと話してくー？いいよー",
    "私に何か用？手伝いならするよー",
]

ZERO_ERR_MES = [
    "0で割っちゃだめだよー",
    "いっぱいかなーたぶんー",
    "いくつかなーわかんないやー",
    "これはきょくげんだねー",
    "分母をだんだんと0に近づけていくと…？あれー？いくつだっけー？",
    "むずかしくってわからないやー"
]

BYE_MES = [
    "ばいばーい",
    "またねー",
    "お手伝いできるときは言ってねー",
    "さよーならー",
    "さよならー",
    "また今度遊ぼうねー"
]

ARAI_MES = [
    "アライさんはねーすぐあさっての方向に行っちゃうんだよねー…\nまあそこがかわいいんだけどねー",
    "やー、アライさんは元気でいいねー\n私まで元気になってくるよー",
    "アライさん、お宝さがしのときに木のうろに手を突っ込んじゃってねー\n抜けなくなっちゃったんだよー\nかわいいよねー",
    "アライさん、森のお宝を探してると思ったら急に海に行っちゃってねー\nなんでか訊いたら私に貝殻をプレゼントするためだったんだー\n…アライさんはかわいいねー",
    "この前アライさんに貝殻をもらったんだー\nこの貝殻を探してるときにアライさんが熱中症になっちゃってねー\nやー、さすがに焦ったなー…うん…\nだからこの貝殻は大切な宝物なんだー",
    "「アライさんにおまかせなのだー！」ってねー\nアライさんについてくとたのしいから、ついついおまかせしちゃうんだよねー",
    "この前海でアライさんと貝殻を探してたときにセルリアンが来てねー\nその時アライさん熱中症でふらふらだったんだよー\nやーあのときシロナガスクジラが助けてくれなかったら危なかったねー"
]

TIRED_MES = [
    "おやおやー\nおつかれさまー",
    "今日はきっといい夢が見られるよー",
    "今日はぐっすり眠れるねー",
    "どうしたのー？大丈夫だよー",
    "一休みすれば、疲れも取れるさー",
    "ちょっと休憩しよっかー",
    "一息入れますかー",
    "ちょっとゆっくりしよっかー",
    "まーまー、ゆっくりいこうねー",
    "何か手伝うことがあったら言ってねー"
]

WELCOME_BACK_MES = [

]


# 汎用時刻メッセージクラス
class Fennec_greets():
    GOOD_NIGHT_MES = [
        "普通ならもうすぐ寝る時間だねー\n私はこの時間になってくると元気になるねー",
        "もうすぐ寝ないとねー"
        "アライさんはもうぐっすりだよー\nふふふっ夜行性なのにねー",
        "アライさんも寝てるし私も寝ちゃおうかなー",
        "まだ寝ないのかい？じゃあもうちょっと話していこうかー"
    ]
    BAD_TIME_MES = [
        "おやおやー？こんな時間に起きてるなんて夜行性なのかなー？",
        "こんな時間に起きてるなんて…悪い子だねー",
        "がおーたべちゃうぞー！なんてねー\n早く寝たほうがいいよー？",
        "眠れないのかなー？ゆっくりしていくかい？",
        "こんこんこん…あけてー…\nふふふ…びっくりしたかい？"
    ]
    EARLY_MORNING_MES = [
        "早起きだねー今日も元気にいこー",
        "今日は早起きだねー\n無理しないようにね？"
    ]
    MORNING_MES = [
        "私は夜行性だからまだちょっとねむいなー…",
        "うーん…アライさんはまだ寝てるねー",
        "アライさんもまだ寝てるし…私ももうひと眠りしますかー",
        "今日もゆっくりいこうねー",
        "二度寝しちゃおうかなー…"
    ]
    LATE_MORNING_MES = [
        "そろそろ目が覚めてくる時間だねー\nけど私は夜行性だからまだ…ふぁああ…",
        "まだ眠たいねー…",
        "ふぁぁ…うーん…うん？少し寝てたよー…"
    ]
    LUNCH_MES = [
        "お昼ごはんはなんだったー？それともまだかなー？",
        "おやーアライさんがジャパリまんを持ってきてくれたよー",
        "今日もアライさんと一緒にジャパリまんを食べたんだー\n君は何をたべたのかなー？"
    ]
    NAP_TIME_MES = [
        "ふぁぁあ…この時間は眠たくなってきちゃうよねー",
        "お昼寝しちゃおうかなー",
        "私は夜行性だからなー\nこの時間まで起きてると眠たくなってきちゃうんだよねー"
    ]
    EVENING_MES = [
        "もうすぐ夕食の時間だねー",
        "そろそろ涼しくなってきたねー",
        "今日はいい夜だねー"
    ]
    DINNER_MES = [
        "夕食はもうたべたかな？",
        "おーボスがジャパリまんを届けてくれたよー",
        "夕食はおいしかった？"
    ]


class Ohayo_fennec(Fennec_greets):
    EARLY_MORNING_MES = [
        "おや？早起きだねー\nそれとも寝てないのかなー？\nちゃんと寝ようねー？",
        "ずいぶんとはやいおはようだねー\n無理しないようにねー？",
    ]
    LATE_MORNING_MES = [
        "こんな時間におはようなんてねぼすけさんだねー\nアライさんみたいだよー",
        "がおー！目は覚めたかい？",
        "もうこの時間だよー今日はゆっくりだねー"
    ]
    LUNCH_MES = [
        "もうお昼ごはんの時間だよー\nじゃぱりまんでも食べるかい？",
        "この時間に起きたんじゃお昼ごはんじゃなくて朝ごはんだねー",
        "機能夜遅くまで起きてたのかな？そんな日もあるよねー"
    ]
    EVENING_MES = [
        "もう夕方だねー\n今日は寝られなさそうだねー",
        "もう夕方だよー？\n夜ふかしでもしたのかなー？",
        "この時間に起きちゃったのかなー？困っちゃうねー"
    ]
    DINNER_MES = [
        "こんな時間に起きちゃったら寝るのは明日になっちゃいそうだねー\nまあでも気楽に行こうよー",
        "おやおやーこの時間におはようだなんて…冗談かなー？",
        "夕食で起きたのかなー？"
    ]


class Konniti_fennec(Fennec_greets):
    pass


class Konban_fennec(Fennec_greets):
    DINNER_MES = [
        "まだだったら一緒にたべるかい？",
        "まだだったらボスからもらって来ようかー？",
        "それとももう食べたかな？",
        "私もそろそろジャパリまん食べようかなー"
    ]


class Oyasumi_fennec(Fennec_greets):
    NAP_TIME_MES = [
        "うん…私も…おやすみー…",
        "ふぁああ…",
        "おやすみって言われちゃうと私まで眠たくなっちゃうよー…",
        "うんうん…お昼寝はいーねー",
        "ふぁぁああ…一緒にお昼寝でもしようかー…"
    ]
    EVENING_MES = [
        "早いねー？おつかれなのかなー？",
        "今日は寝るのが早いねー？お疲れ様だねー",
        "ご飯はまだたべてないかな？\n"
    ]
    DINNER_MES = [
        "おやー？今日は早寝だねー\n寝る子は育つってねー",
        "ご飯たべて眠たくなっちゃったかな？",
        "早いねー？今日はよく眠れそうだねー"
    ]
